---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.MultipleIdsInCurtainSystem
source: html/be6e2c31-7b9c-5487-0e7d-8323dcc7e030.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.MultipleIdsInCurtainSystem Property

A Curtain System cannot be based on faces from multiple elements.

## Syntax (C#)
```csharp
public static FailureDefinitionId MultipleIdsInCurtainSystem { get; }
```